[
  {
    "id": 1,
    "category": "core",
    "title": "Curiosity About Physical and Mental Limits",
    "bullets": [
      "Desire to explore how far, how hard, and how long the body and mind can go",
      "Testing limits of pain, effort, hunger, thirst, sleep, speed, distance",
      "Discovering that the mind gives up long before the body",
      "Fascination with the shifting \"I can't go on → I'm actually fine\" transition"
    ],
    "rawText": "So definitely one thing that is recurrent is the curiosity of the limits of my body. Meaning, how much can I do? How far can I go? How hard can I push? In terms of effort level, in terms of distance, in terms of speed, in terms of pain, in terms of regret, in terms of food—like hunger, thirst, sleep, and so on. So when you get to a certain level of fitness, when I got—I started to feel very curious about that, like exploring this, because the observation is that once you start, when I started doing harder runs, is that the mind makes me stop way before I need it, way before the body gives up.\n\nSo that raises the question, like, why is that? Like, how is that basically—like a thing that seems synchronized is not at all synchronized? Like, there is an apparent relationship between how much you can take mentally and how much you can take physically, but it's in the—especially in the beginning. Your mind is saying all the time that you should stop with not too much effort, actually. So if you ignore that and keep pushing, you can go way further.\n\nAnd what is very interesting is that at some point, depending on the situation—happened many times with me—the mindset changes. So suddenly I feel like I can't do this anymore. And then I push through, and then I'm like, oh, I actually feel fine. I can go like the same amount of time, even longer, and I don't even know how much longer—can be maybe infinitely longer. That's the feeling. So this is very interesting. And then suddenly you realize that there is a lot of kind of sabotage, which is probably like a protection mechanism that makes you to be like a more safe zone, in terms of how much you can push your body to go.\n\nTesting"
  },
  {
    "id": 2,
    "category": "core",
    "title": "Cultivation of Fitness to Enable Exploration",
    "bullets": [
      "Staying fit as a prerequisite to validly explore limits",
      "Knowing past achievements sets a higher baseline of what's possible",
      "Maintaining both physical and mental conditioning to avoid false limits"
    ],
    "rawText": "So that's one—definitely one reason. And once you reach—once you do something that you consider hard and you actually reach a very high effort level, then you want to keep fit because, let's say you go and do something that is comparatively, in an objective manner, less hard than something that you have already done. But you feel totally exhausted and like you reached your limit, then I question—I'm like, oh my God, I could do way harder things. I'm just not trained. So that makes me keep wanting to keep a given fitness level that I can always kind of explore more than that, because if I reduce my fitness, this is not going to be actually a valid conclusion, because I know that I can go harder if I am fitter. And not only like physically fit, but mentally fit, because you get used to the kind of training loads, the recovery, and so on. So if you stop doing these things, they become harder, but then you don't discover your limits very much. So that's basically like exploration number one. It's like curiosity, and then to keep—it's like you have to cultivate that physique and fitness level to keep exploring. Otherwise, you basically can't know what you are actually capable of, because you know that you have done harder things in the past."
  },
  {
    "id": 3,
    "category": "core",
    "title": "Feeling Special / Being in the Minority",
    "bullets": [
      "Awareness that very few people want or can do this",
      "Feeling different, unique, even \"crazy\" in a positive way",
      "Enjoying being perceived as extraordinary or impressive"
    ],
    "rawText": "Then explanation two. It's kind of linked to that. It's like, actually, not everyone has this mindset. So it's like not everyone wants to explore their limits in an extreme way. And some might want to, but they haven't done it yet, and some don't know that they want to, which is often the case when you begin running. Like, you don't know that you want that. Like, you might not be the source of the reason you started running in the first place, so you might not know. So that is tightly linked, because once you realize that you are like kind of the minority of people, you feel special. Like, I feel special. I feel like, oh my God, I'm doing something that most people don't do, can't do, find it impressive. So it makes me feel powerful. It makes me feel like I'm different, and I differentiate myself from other people in a good way, like I am doing something that is unique and I'm pushing my limits in a way that I'm getting this feeling that not everyone has. So it's like a bit of a feeling of being special.\n\nTied to that is also—you want to keep doing it, because you want to keep exploring, talking to people. I want to, like, find more and more. Like, I have people who—sometimes I like the idea that I'm being considered unique or crazy or whatever related."
  },
  {
    "id": 4,
    "category": "core",
    "title": "Pride, Confidence, and Personal Empowerment",
    "bullets": [
      "Deep pride after completing extremely hard efforts",
      "Carryover confidence into everyday life",
      "Knowing you've done something harder than most people can imagine",
      "A \"secret strength\" that stabilizes self-esteem"
    ],
    "rawText": "Explanation number three—it's linked to that. It's like, let's say you do something that is very hard, and I feel like when I accomplish something like that, I get extremely proud of myself. I feel powerful, I feel limitless, I feel like I can do anything I want. And that's partially because very few people would be able to do that. So after running, like, for ten hours in a row, finishing a race strong, going back home destroyed, but then waking up way more recovered and just going about my life, to work normally—it's like people have no idea what I just did. So it feels extremely special. I feel more confident in my life overall, and that basically prepares me for moments that I would normally feel insecure. I feel secure about it because I know I did something way harder. That is a bit of a secret to most people."
  },
  {
    "id": 5,
    "category": "core",
    "title": "Competitiveness (Internal and External)",
    "bullets": [
      "Desire to improve on previous performances",
      "Drive to race well, place, podium, or win",
      "Strategic thinking about performance optimization"
    ],
    "rawText": "Explanation number four is related to competitiveness, which is tightly related to this one. It's like, \"Oh, I did it better than last time\" for myself. But then, once you get to a certain level—I got to a certain level—that I actually became somehow competitive in some races. I like—I want to beat that. I want to, like, be on the podium. I'm gonna win this. And I think I can do it if I do it this way. So, like, explanation 4 is related to competitiveness."
  },
  {
    "id": 6,
    "category": "embodied",
    "title": "Connection to Nature as a Natural Human State",
    "bullets": [
      "Running as the most \"natural\" human movement",
      "Feeling evolutionarily aligned as a Homo sapiens",
      "Preference over cycling, skiing, swimming"
    ],
    "rawText": "Now, um there all people can do all sorts of stuff to feed one, two, three, and four. Why did I choose endurance especially ultra running, especially trail running, is because I love nature. I love to be outside. I love to be in the mountains. I love to connect with the nature is the time that I feel mostly natural connected to my environment if you so natural it's like the best place to be. It's so evolutionarily the case. I mean, you are like outside, you are free. It's not like cycling. It's not like skiing. It's not like swimming. It's my natural environment as a homo sapiens. Feels like extremely natural."
  },
  {
    "id": 7,
    "category": "embodied",
    "title": "Deep Sensory Immersion in the Environment",
    "bullets": [
      "Love of mountains, sea, animals, plants",
      "Enjoying smells, textures, sounds, mud, rain, water",
      "Feeling fully embedded in the landscape",
      "Longing to live in nature rather than return home"
    ],
    "rawText": "The develop of nature I love the mountain. I love the sea. I love the animals. I love the plants, the fi. Everything about it. I observe, I feel I feel like a sense, the smell I touch, I love the smells so I love the touch. Of trees, I love the the sounds. My feet on the ground, the water flowing, the rain, I love the mud. I love to have my body connected to that environment. If it a natural when I come back home, like, I wish I just lived out there. And that might be something that I'm gonna pursue more and more."
  },
  {
    "id": 8,
    "category": "embodied",
    "title": "Pleasure, Euphoria, and Reward",
    "bullets": [
      "Endorphins and runner's high",
      "Heightened pleasure after deprivation (water, food, warmth)",
      "Contrast-based enjoyment (cold → hot shower, hunger → food)"
    ],
    "rawText": "Inspiration number seven, maybe it's related to pleasure. It's like, of course, running, and exercising hard gives gives me a lot of pleasure, I feel like euphoric. If you relaxed after I shower, hot shower, after a cold run, or incredibly good. There is like a also society, like being thirsty and then drinking water, electrolytes, being hungry, and then eating something after the run, all of these tastes better. They the drinks, taste better and a lot of pleasure."
  },
  {
    "id": 9,
    "category": "embodied",
    "title": "Meditative Focus and Mental Clarity",
    "bullets": [
      "Entering a deeply focused, present state",
      "External worries recede as terrain and effort demand attention",
      "Harder and more technical terrain increases mental stillness"
    ],
    "rawText": "Explanation number nine. It's similar. It's like, there's a meditative state. It puts me in a place that I feel concentrated, and um everything else, kind of get a second place, like, that's happening in my life. It's a time for myself with myself that the harder it is, the more technical the terrain is, the more challenging it is, the more I have to focus and therefore, less space I have in my mind for the external world, other things work, and so on, so forth."
  },
  {
    "id": 10,
    "category": "embodied",
    "title": "Pleasure in Pain, Suffering, and Uncertainty",
    "bullets": [
      "Enjoyment of prolonged discomfort and fear",
      "Masochistic component acknowledged without judgment",
      "Pain as a mechanism that collapses thought into pure presence"
    ],
    "rawText": "Her explanation, now eight or nine, I'm not sure, is probably related to, to that, but in a bit darker way, it's the the pleasure of the pain, of suffering, the pleasure of actual feeling pain for a long period of time, and the pleasure of feeling fear and uncertainty for a long time. That's a bit harder to explain because this is very real, but at the same time, it's like. is it bad to feel this way? Like, is it like, um, kind of wrong to feel this way? So, I by talking about it and admitting that, it's making me it easier for me to do that. It's definitely. There is definitely a pleasure on that. And I think that's connected to the explanation before. We made meditation or easiness of stuff like when you have so much pain, that every step it hurts, you can't think about anything else. I mean, you just have to keep moving. You're thinking about your body and so on. So there is definitely a component of a bit of masochism."
  },
  {
    "id": 11,
    "category": "embodied",
    "title": "Deepened Connection With the Body",
    "bullets": [
      "Learning anatomy, pain types, physiology",
      "Awareness of muscles, tendons, organs, limits",
      "Rediscovering bodily intelligence lost in adulthood"
    ],
    "rawText": "And that relates to explanation number ten, which is connection with my body. Like, before running, I had no idea about my body—my body parts, the types of pain that exist, if it's muscle pain, if it's tendon pain, where my organs were, where my muscles were, where the bones, the ligaments, the retinaculum—any of that. Like, I had no idea. So as much as running is a journey to discover the outside world, it is the same to discover the mind, or like my mind, and my body—like all the parts, how they function, the physiology, and so on. So running connected me way more to my body. So that's definitely something that we lose, or something I lost as I grew up, for several reasons."
  },
  {
    "id": 12,
    "category": "identity",
    "title": "Playfulness and Childlike Joy",
    "bullets": [
      "Running as play rather than labor",
      "Downhill running as a game",
      "Joy in mud, rain, silliness, jumping, posing",
      "Reconnection with childhood embodiment"
    ],
    "rawText": "So I feel like one of the big, big explanations is the playfulness. Like, when I was a kid, I was more connected to my body, I was more connected to nature. Running is playing. Like, when I run downhill, I feel like I'm playing a video game, almost—like a game that I have to deviate, I have to jump. If I fall, I have to, like, get back on my feet. There is speed, adrenaline. I love when it's raining and there is mud, because then there are puddles and the splashes of water, splashes of mud. So it brings me back to a more natural, child state of enjoyment, of silliness. I see very often, like, when I'm running on my trails, that we do some silly things, pose for photos in a silly way. We do, like, little jumps, we smile at each other and perform."
  },
  {
    "id": 13,
    "category": "identity",
    "title": "Social Bonding Through Shared Hardship",
    "bullets": [
      "Training and racing as deeply social experiences",
      "Bonding through pain, effort, and altered states",
      "Strong friendships built through shared adversity"
    ],
    "rawText": "So that leads to explanation number twelve, which is the social aspect of running. People think running is an individual sport, but running is not at all an individual sport. It's a team sport. And training—it is a lot—a very powerful way. Training together is a very powerful way to make friendships, because you are sharing—like, I feel like I'm sharing these moments with people that I like. And these are hard moments, so it's like bonding through pain, bonding through effort, and enjoying—like, having the same trip, like being stoned together by endorphins and adrenaline, and sharing that moment in a very raw way, and then carrying all of these other explanations, all of the accomplishments, all of the pride, and so on, with other people."
  },
  {
    "id": 14,
    "category": "identity",
    "title": "Team and Support Ecosystem",
    "bullets": [
      "Coaches, teammates, crew, pacers",
      "Physical therapists, medical professionals",
      "Collective preparation and shared goals"
    ],
    "rawText": "So there is this in training, in racing. It's also in training. It's also beyond that. It's like the community, the coach, the team of people that you are working with, with the physical therapist, if it's an orthopedic surgeon, your, let's say, your run club, and so on. You know, reading about running—all of this is a very, very social and meaningful connection experience.\n\nThen there is the racing part that is also extremely social, which is your crew members, like people that I love and care about. They go and help me doing this, run these races. There is a whole help related to me—pacing and then crewing and preparing to the moment. All of this is an additional sharing with people that I love and care about."
  },
  {
    "id": 15,
    "category": "identity",
    "title": "Community and Belonging",
    "bullets": [
      "Local clubs, race communities, shared culture",
      "Long-term relationships (e.g., Golden Gate Trail Run Club)",
      "Shared adventures and spontaneous commitment"
    ],
    "rawText": "And it's to the next explanation, which is basically more the community of it. So running is not only social for you, but it's like there is a whole community around it. And the community can be your local running club, it can be, let's say, like, a race series. It can be, yeah, the more global—thinking about sharing something that is good for you, like the whole relationship with nature, environment, and so on. So, yeah, definitely this is one of the biggest things that I discovered with my running community, especially now the Golden Gate Trail Run Club for me—years and all the friends, all the adventures we did together to the Grand Canyon, Yosemite, all the adventures here in San Francisco, around here, like running from home to Stinson Beach, running from home to the top of Mount Tam. Yeah. Having people that I can just call, like, the night before, and they will be willing to go on an adventure like that with me for hours and hours and so on. The community is, like, an incredible reason as well."
  },
  {
    "id": 16,
    "category": "meaning",
    "title": "Connection to Place and Land",
    "bullets": [
      "Running as a way to understand where you live",
      "Deepened awareness of ecosystems and human impact"
    ],
    "rawText": "And then the community also leads to, like, okay, what are we doing here? So there is, like, a whole other part of the community that is the connection with where we are. What is this land? What is the nature around here? How are my actions affecting it? I love it so much that I started to think—I love nature so much, and these mountains, and this region so much—that I started to think more about it."
  },
  {
    "id": 17,
    "category": "meaning",
    "title": "Environmental Awareness and Responsibility",
    "bullets": [
      "Heightened sensitivity to environmental destruction",
      "Stronger emotional reaction to mining, exploitation, degradation",
      "Desire to protect what you love"
    ],
    "rawText": "Like, what are the effects of, like, especially, for example, in my country, like Minas in Brazil, and mines around Belo Horizonte, and all of the mining activity. I had a totally different, like way more intense aversion to all of that, because of what happened, what happens with the environment.\n\nAnd I started to have this feeling when we moved to the Bay Area, but more intensely when I started to photograph the life and the garden of the house, that I really started to research and pay attention to that, and the effects of, like, human interventions. And this last time that I went to Brazil, I felt it a lot stronger—like, what a pity, like, how bad."
  },
  {
    "id": 18,
    "category": "meaning",
    "title": "Historical and Cultural Reflection",
    "bullets": [
      "Awareness of colonial history, slavery, land exploitation",
      "Comparing Brazil and California's gold histories",
      "Running as a portal into historical consciousness"
    ],
    "rawText": "And then I started to think about the whole environmental aspect, but then the whole historical aspect of it—of how gold was exploited historically in that region, how much that was different compared with California. Because differently from California, the gold in Brazil, in Minas specifically, was discovered by the Portuguese during colonial times. So how the gold flowed, was transported from Brazil to Europe—so nothing stayed there. Whereas in California, the gold was discovered way later, after the country was independent, which means that the gold stayed here and fueled all of the innovation and so on.\n\nOn top of that, all the gold extraction in Brazil was done by slaves, and that shaped the whole society. And here that was not the case. So this is just an example of how running can bring you to history as well, the past, by running on these lands that once were native territory, like here, and then they got totally exploited by colonization. It makes me realize the depth of the historical context, geographical context that I live in."
  },
  {
    "id": 19,
    "category": "personal",
    "title": "Self-Exploration and Identity Inquiry",
    "bullets": [
      "Questioning motives: \"What am I proving, and to whom?\"",
      "Running as a mirror into deeper psychological patterns"
    ],
    "rawText": "And then there is probably another explanation that now I lost the count, but it's related to my own story. So it makes me realize more about myself as well—like, why am I doing this? Like, why am I doing these things that are so hard? What am I trying to prove, to whom?"
  },
  {
    "id": 20,
    "category": "personal",
    "title": "Healing Insecurity and Fear From Early Life",
    "bullets": [
      "Addressing long-standing insecurity about body and ability",
      "Shifting from purely intellectual identity to embodied competence"
    ],
    "rawText": "And that brings me back to maybe the hardest explanation to talk about, which is me growing up and feeling myself insecure in so many ways, afraid in so many ways, probably because of how I was raised. And then, really not comfortable with my body, not comfortable with my skills. Not, yeah, comfortable with what I could do, what people saw in me. And I approached this in a way that it started with intellect. So I discovered early that I had some advantages on the intellectual part compared to my colleagues. In the musical part as well. So I exploited that for most of my life. I went and studied hard, did a PhD, became a scientist. But I was lacking the other aspect, which was the physical one, and that took me a while, because I didn't know I had any advantage in that."
  },
  {
    "id": 21,
    "category": "personal",
    "title": "Discovering Physical Talent and Capability",
    "bullets": [
      "Realizing natural strengths (especially uphill running)",
      "Redefining self-image relative to others",
      "Proving to yourself that you can do the hardest things"
    ],
    "rawText": "But then, when I discovered running, I discovered that—especially—I discovered that I have some advantages and kind of an easiness to run uphill. My body is slim, and I have, like, strong legs, so I had not too much trouble in becoming good at running uphill. So, yeah, I'm sure that there's a lot in this journey that ties back to my earlier experiences of insecurity and fear, and proving to myself now that I can do anything. I can do the hardest things—things that I only considered that some way stronger people than me could do. Some of my friends that looked stronger, and now I'm like, they would never be able to do something like that. Of course, if they trained, everyone would be able to, but at their current state, they would not. And so definitely that place is a big, big growth as well."
  },
  {
    "id": 22,
    "category": "emerging",
    "title": "Health, Longevity, and Sustainability (Emerging)",
    "bullets": [
      "Acknowledged as less central historically",
      "Growing concern with aging, injury prevention, longevity",
      "Hiring a coach to train responsibly and sustainably"
    ],
    "rawText": "So I guess that's it. I guess it's a comprehensive list of explanations of why I run, how much running is important in my life. And the funny thing is that I didn't think much to say, and probably because this really plays a minor role, which is fitness level and, like, longevity. I don't think I run to get fit, to be healthy, to be honest. I do think I run a bit better, but I don't think I have too much of a reason that is related to actual health. And that's something that is kind of starting to bother me a little bit, and I think I should have more of that.\n\nAnd I think that's going to help in running in any direction, even for performance. Like, if I introduce that kind of reason more explicitly—one is that it is making me very healthy, and it can make me very healthy if done in a responsible way. So I think that's why I hired a coach, working with a coach now, because I'm thinking more about longevity, getting older and wanting to train properly, preventing injury, because repeated injury is the strongest prediction of detrimental effects in the long term. So the best way to prevent injury is, of course, to train smart, and the best way to train smart is to be trained—to be coached—by an experienced coach."
  },
  {
    "id": 24,
    "category": "simulation",
    "title": "Simulation of Life Itself",
    "bullets": [
      "Running and racing as a metaphor for the full life cycle: beginning, growth, crisis, decline, resolution, and rebirth",
      "Each run reproduces life at a compressed timescale",
      "Pain, fear, and exhaustion are phases, not endpoints",
      "Strong pain does not mean the race is over; everything passes",
      "Success depends on continuous problem-solving under uncertainty",
      "Solutions are often counterintuitive",
      "Learning to adapt rather than panic",
      "Training trust in impermanence, resilience, and creativity in adversity"
    ],
    "rawText": "I have 2 extra to add. 1. simulation of life itself. like the from birth to death and rebirth like a metaphor for life itself daily, problem solving during races. strong pain does not mean race is over, everything passes, you just need to find the solution. sometimes it is very counterintuitive. like cultivating a cramp pain to distract from a higher pain."
  },
  {
    "id": 25,
    "category": "simulation",
    "title": "Trajectories, Navigation, and the Beauty of Routes",
    "bullets": [
      "Fascination with paths, routes, and movement through space",
      "Meaning in trajectories with a clear beginning, middle, and end",
      "Appreciation for loops, out-and-back routes, traverses, and point-to-point journeys",
      "Navigation as both a cognitive and aesthetic experience",
      "The route itself as the objective, not just the outcome",
      "Satisfaction in linking landscapes coherently over time",
      "Running as exploration shaped by geography, choice, and flow"
    ],
    "rawText": "2. trajectories, navigation, fascination with routes, beginning to the end, loops, the beauty of the path."
  }
]